; domain
;java -cp ../build/libs/pddl4j-4.0.0.jar fr.uga.pddl4j.planners.statespace.FF domainsimple.pddl p01.pddl
;why this heuristic, what makes LPG different? force to stop at storage
;sequential solver is needed to model tasks at the same time, since this solver generates a sequential plan so doing things in parallel doesn't matter
(define (domain WAREHOUSE)
    (:requirements :strips :typing :negative-preconditions)
    (:types 
        package person - physobj
        carrier - person
        arrivaldoc storage loadingdoc - place
        place - object
        physobj - object
    )

    (:predicates (at ?obj - object ?loc - place)
    (carrying ?p - person ?pkg - package) ; Is the person holding the package?
    (hands-empty ?p - person) ; Is the person free to pick something up?
    (processed ?pkg - package) ;     package most be processed
    (connected ?from - place ?to - place)
    )
    
    (:action pick-up
        :parameters (?pkg - package ?p - person ?loc - place)
        :precondition (and (at ?pkg ?loc)(at ?p ?loc)(hands-empty ?p))
        :effect (and(not (at ?pkg ?loc)) (not (hands-empty ?p)) (carrying ?p ?pkg)))
        
    ;; Action: Carrier moves from one place to another
    (:action move
        :parameters (?p - person ?from - place ?to - place)
        :precondition (and (at ?p ?from) (connected ?from ?to)) ; <--- Must be connected!
        :effect (and (not (at ?p ?from)) (at ?p ?to))
    )

    ;; Action: Carrier drops the package at the new location
;; NEW ACTION: Only works when the person is at a 'storage' type location
    (:action process-package
        :parameters (?p - person ?pkg - package ?loc - storage) 
        :precondition (and (at ?p ?loc) (carrying ?p ?pkg))
        :effect (processed ?pkg)
    )

    (:action drop-off
        :parameters (?p - person ?pkg - package ?loc - place)
        :precondition (and (at ?p ?loc) (carrying ?p ?pkg))
        :effect (and (at ?pkg ?loc) (hands-empty ?p) (not (carrying ?p ?pkg)))
    )
)

; problem
(define (problem P01)
(:domain WAREHOUSE)
(:objects
    pkg1 - package
    p1 - person
    a1 - arrivaldoc
    s1 - storage
    l1 - loadingdoc
)

(:init
    (at pkg1 a1)
    (at p1 a1)
    (hands-empty p1)
    (connected a1 s1) (connected s1 a1) ; Path between Arrival and Storage
    (connected s1 l1) (connected l1 s1) ; Path between Storage and Loading
)

(:goal 
    (and 
        (at pkg1 l1) 
        (processed pkg1)
        (at p1 a1)

    )
)
)

; plan
1. (pick-up pkg1 p1 a1)
   deleted: (at pkg1 a1) (hands-empty p1)
   added: (carrying p1 pkg1)
   goals met: 1 of 3
2. (move p1 a1 s1)
   deleted: (at p1 a1)
   added: (at p1 s1)
   goals met: 0 of 3
3. (process-package p1 pkg1 s1)
   added: (processed pkg1)
   goals met: 1 of 3
4. (move p1 s1 l1)
   deleted: (at p1 s1)
   added: (at p1 l1)
   goals met: 1 of 3
5. (drop-off p1 pkg1 l1)
   deleted: (carrying p1 pkg1)
   added: (at pkg1 l1) (hands-empty p1)
   goals met: 2 of 3
6. (move p1 l1 s1)
   deleted: (at p1 l1)
   added: (at p1 s1)
   goals met: 2 of 3
7. (move p1 s1 a1)
   deleted: (at p1 s1)
   added: (at p1 a1)
   goals met: 3 of 3
